"-------------------------------------------------------------------------------
" どこでも使う設定
" 迷ったら雑多にここ
"-------------------------------------------------------------------------------
"-------------------------------------------------------------------------------
" 入力補完
"-------------------------------------------------------------------------------
inoremap { {}<LEFT>
inoremap [ []<LEFT>
inoremap ( ()<LEFT>
"inoremap " ""<LEFT>
"inoremap ' ''<LEFT>
vnoremap { "zdi^V{<C-R>z}<ESC>
vnoremap [ "zdi^V[<C-R>z]<ESC>
vnoremap ( "zdi^V(<C-R>z)<ESC>
"vnoremap " "zdi^V"<C-R>z^V"<ESC>
"vnoremap ' "zdi'<C-R>z'<ESC>

""-------------------------------------------------------------------------------
"" alias系
""-------------------------------------------------------------------------------
":command Tbn tabnext
":command Tbp tabprevious
":command Tbw tabnew

"-------------------------------------------------------------------------------
" 検索系
"-------------------------------------------------------------------------------
set ignorecase    "小文字の検索でも大文字も見つかるようにする
set smartcase     "ただし大文字も含めた検索の場合はその通りに検索する
set incsearch     "インクリメンタルサーチを行う
set nowrapscan    "(no)検索をファイルの末尾まで検索したら、ファイルの先頭へループする
set history=1000  "コマンド、検索パターンを100個まで履歴に残す

"-------------------------------------------------------------------------------
" タブ系
"-------------------------------------------------------------------------------
set tabstop=4     "ファイル内の <tab> が対応する空白の数
set autoindent
set shiftwidth=4
set expandtab     "Insertモードで<tab> を挿入するのに、適切な数の空白を使う
set smarttab      "行頭の余白内で Tab を打ち込むと、'shiftwidth' の数だけインデントする

"-------------------------------------------------------------------------------
" 連番ふる
"-------------------------------------------------------------------------------
nnoremap <silent> co :ContinuousNumber <C-a><CR>
vnoremap <silent> co :ContinuousNumber <C-a><CR>
command! -count -nargs=1 ContinuousNumber let snf=&nf|set nf-=octal|let cl = col('.')|for nc in range(1, <count>?<count>-line('.'):1)|exe 'normal! j' . nc . <q-args>|call cursor('.', cl)|endfor|unlet cl|unlet snf
